---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.Profile
source: html/92eaf5b2-4d2c-bba2-d326-dddc7e20a04a.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.Profile Property

The connector profile.

## Syntax (C#)
```csharp
public ConnectorProfileType Profile { get; }
```